exemple/request-authentication.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soap="http://soap.com.br">
   <soapenv:Header>
   	<wsse:Security 
   		xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
   	 	mustUnderstand="1">
	      <wsse:UsernameToken>
	        <wsse:Username>everson</wsse:Username>
	        <wsse:Password>123</wsse:Password>
	      </wsse:UsernameToken>
    </wsse:Security>
   </soapenv:Header>
   <soapenv:Body>
      <soap:GetCustomerDetailRequest>
         <soap:id>1</soap:id>
      </soap:GetCustomerDetailRequest>
   </soapenv:Body>
</soapenv:Envelope>